---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeDefinition.HasParameter(Autodesk.Revit.DB.ElementId)
source: html/beb7f2f1-6d94-210c-2928-09bbfa4a1294.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinition.HasParameter Method

Whether the definition stores the parameter.

## Syntax (C#)
```csharp
public bool HasParameter(
	ElementId paramId
)
```

## Parameters
- **paramId** (`Autodesk.Revit.DB.ElementId`) - Id of a parameter.

## Returns
True if the definition stores the parameter, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null